Autodesk.Revit.DB.ViewPosition.GetPlacedViewportIdsForViewPosition
Gets the placed viewport ids for the view position.
Returns:
The placed viewport ids for the view position.
Since:
2026

Autodesk.Revit.DB.ViewPosition.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ViewAnchor)
Creates a new view position element.
document:
The document to which the ViewPosition will be added.
name:
The name of the view position element.
position:
The position of the view.
viewAnchor:
The method the view will be positioned on the sheet.
Returns:
The newly created view position element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
The given value for name is already in use as a view position name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.ViewPosition.ViewAnchor
Specifies the method by which the view will be positioned on the sheet. Default is set to ViewAnchor.ViewOrigin.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2026

Autodesk.Revit.DB.ViewPosition.Position
Specifies view's position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2026

Autodesk.Revit.DB.ViewPosition
This class represents the view position element.
Since:
2026